name: "MobileNet"
op {
  input: "data"
  input: "conv1_w"
  output: "conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
}
op {
  input: "conv1"
  input: "conv1/bn_scale"
  input: "conv1/bn_bias"
  input: "conv1/bn_mean"
  input: "conv1/bn_var"
  output: "conv1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv1/bn"
  input: "conv1/bn_w"
  output: "conv1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv1/bn_internal"
  input: "conv1/bn_b"
  output: "conv1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv1/bn"
  output: "conv1/bn"
  type: "Relu"
}
op {
  input: "conv1/bn"
  input: "conv2_1/dw_w"
  output: "conv2_1/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 32
  }
}
op {
  input: "conv2_1/dw"
  input: "conv2_1/dw/bn_scale"
  input: "conv2_1/dw/bn_bias"
  input: "conv2_1/dw/bn_mean"
  input: "conv2_1/dw/bn_var"
  output: "conv2_1/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv2_1/dw/bn"
  input: "conv2_1/dw/bn_w"
  output: "conv2_1/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_1/dw/bn_internal"
  input: "conv2_1/dw/bn_b"
  output: "conv2_1/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_1/dw/bn"
  output: "conv2_1/dw/bn"
  type: "Relu"
}
op {
  input: "conv2_1/dw/bn"
  input: "conv2_1/sep_w"
  output: "conv2_1/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv2_1/sep"
  input: "conv2_1/sep/bn_scale"
  input: "conv2_1/sep/bn_bias"
  input: "conv2_1/sep/bn_mean"
  input: "conv2_1/sep/bn_var"
  output: "conv2_1/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv2_1/sep/bn"
  input: "conv2_1/sep/bn_w"
  output: "conv2_1/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_1/sep/bn_internal"
  input: "conv2_1/sep/bn_b"
  output: "conv2_1/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_1/sep/bn"
  output: "conv2_1/sep/bn"
  type: "Relu"
}
op {
  input: "conv2_1/sep/bn"
  input: "conv2_2/dw_w"
  output: "conv2_2/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 64
  }
}
op {
  input: "conv2_2/dw"
  input: "conv2_2/dw/bn_scale"
  input: "conv2_2/dw/bn_bias"
  input: "conv2_2/dw/bn_mean"
  input: "conv2_2/dw/bn_var"
  output: "conv2_2/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv2_2/dw/bn"
  input: "conv2_2/dw/bn_w"
  output: "conv2_2/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_2/dw/bn_internal"
  input: "conv2_2/dw/bn_b"
  output: "conv2_2/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_2/dw/bn"
  output: "conv2_2/dw/bn"
  type: "Relu"
}
op {
  input: "conv2_2/dw/bn"
  input: "conv2_2/sep_w"
  output: "conv2_2/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv2_2/sep"
  input: "conv2_2/sep/bn_scale"
  input: "conv2_2/sep/bn_bias"
  input: "conv2_2/sep/bn_mean"
  input: "conv2_2/sep/bn_var"
  output: "conv2_2/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv2_2/sep/bn"
  input: "conv2_2/sep/bn_w"
  output: "conv2_2/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_2/sep/bn_internal"
  input: "conv2_2/sep/bn_b"
  output: "conv2_2/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv2_2/sep/bn"
  output: "conv2_2/sep/bn"
  type: "Relu"
}
op {
  input: "conv2_2/sep/bn"
  input: "conv3_1/dw_w"
  output: "conv3_1/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 128
  }
}
op {
  input: "conv3_1/dw"
  input: "conv3_1/dw/bn_scale"
  input: "conv3_1/dw/bn_bias"
  input: "conv3_1/dw/bn_mean"
  input: "conv3_1/dw/bn_var"
  output: "conv3_1/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv3_1/dw/bn"
  input: "conv3_1/dw/bn_w"
  output: "conv3_1/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_1/dw/bn_internal"
  input: "conv3_1/dw/bn_b"
  output: "conv3_1/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_1/dw/bn"
  output: "conv3_1/dw/bn"
  type: "Relu"
}
op {
  input: "conv3_1/dw/bn"
  input: "conv3_1/sep_w"
  output: "conv3_1/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv3_1/sep"
  input: "conv3_1/sep/bn_scale"
  input: "conv3_1/sep/bn_bias"
  input: "conv3_1/sep/bn_mean"
  input: "conv3_1/sep/bn_var"
  output: "conv3_1/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv3_1/sep/bn"
  input: "conv3_1/sep/bn_w"
  output: "conv3_1/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_1/sep/bn_internal"
  input: "conv3_1/sep/bn_b"
  output: "conv3_1/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_1/sep/bn"
  output: "conv3_1/sep/bn"
  type: "Relu"
}
op {
  input: "conv3_1/sep/bn"
  input: "conv3_2/dw_w"
  output: "conv3_2/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 128
  }
}
op {
  input: "conv3_2/dw"
  input: "conv3_2/dw/bn_scale"
  input: "conv3_2/dw/bn_bias"
  input: "conv3_2/dw/bn_mean"
  input: "conv3_2/dw/bn_var"
  output: "conv3_2/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv3_2/dw/bn"
  input: "conv3_2/dw/bn_w"
  output: "conv3_2/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_2/dw/bn_internal"
  input: "conv3_2/dw/bn_b"
  output: "conv3_2/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_2/dw/bn"
  output: "conv3_2/dw/bn"
  type: "Relu"
}
op {
  input: "conv3_2/dw/bn"
  input: "conv3_2/sep_w"
  output: "conv3_2/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv3_2/sep"
  input: "conv3_2/sep/bn_scale"
  input: "conv3_2/sep/bn_bias"
  input: "conv3_2/sep/bn_mean"
  input: "conv3_2/sep/bn_var"
  output: "conv3_2/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv3_2/sep/bn"
  input: "conv3_2/sep/bn_w"
  output: "conv3_2/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_2/sep/bn_internal"
  input: "conv3_2/sep/bn_b"
  output: "conv3_2/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv3_2/sep/bn"
  output: "conv3_2/sep/bn"
  type: "Relu"
}
op {
  input: "conv3_2/sep/bn"
  input: "conv4_1/dw_w"
  output: "conv4_1/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 256
  }
}
op {
  input: "conv4_1/dw"
  input: "conv4_1/dw/bn_scale"
  input: "conv4_1/dw/bn_bias"
  input: "conv4_1/dw/bn_mean"
  input: "conv4_1/dw/bn_var"
  output: "conv4_1/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv4_1/dw/bn"
  input: "conv4_1/dw/bn_w"
  output: "conv4_1/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_1/dw/bn_internal"
  input: "conv4_1/dw/bn_b"
  output: "conv4_1/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_1/dw/bn"
  output: "conv4_1/dw/bn"
  type: "Relu"
}
op {
  input: "conv4_1/dw/bn"
  input: "conv4_1/sep_w"
  output: "conv4_1/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv4_1/sep"
  input: "conv4_1/sep/bn_scale"
  input: "conv4_1/sep/bn_bias"
  input: "conv4_1/sep/bn_mean"
  input: "conv4_1/sep/bn_var"
  output: "conv4_1/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv4_1/sep/bn"
  input: "conv4_1/sep/bn_w"
  output: "conv4_1/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_1/sep/bn_internal"
  input: "conv4_1/sep/bn_b"
  output: "conv4_1/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_1/sep/bn"
  output: "conv4_1/sep/bn"
  type: "Relu"
}
op {
  input: "conv4_1/sep/bn"
  input: "conv4_2/dw_w"
  output: "conv4_2/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 256
  }
}
op {
  input: "conv4_2/dw"
  input: "conv4_2/dw/bn_scale"
  input: "conv4_2/dw/bn_bias"
  input: "conv4_2/dw/bn_mean"
  input: "conv4_2/dw/bn_var"
  output: "conv4_2/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv4_2/dw/bn"
  input: "conv4_2/dw/bn_w"
  output: "conv4_2/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_2/dw/bn_internal"
  input: "conv4_2/dw/bn_b"
  output: "conv4_2/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_2/dw/bn"
  output: "conv4_2/dw/bn"
  type: "Relu"
}
op {
  input: "conv4_2/dw/bn"
  input: "conv4_2/sep_w"
  output: "conv4_2/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv4_2/sep"
  input: "conv4_2/sep/bn_scale"
  input: "conv4_2/sep/bn_bias"
  input: "conv4_2/sep/bn_mean"
  input: "conv4_2/sep/bn_var"
  output: "conv4_2/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv4_2/sep/bn"
  input: "conv4_2/sep/bn_w"
  output: "conv4_2/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_2/sep/bn_internal"
  input: "conv4_2/sep/bn_b"
  output: "conv4_2/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv4_2/sep/bn"
  output: "conv4_2/sep/bn"
  type: "Relu"
}
op {
  input: "conv4_2/sep/bn"
  input: "conv5_1/dw_w"
  output: "conv5_1/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_1/dw"
  input: "conv5_1/dw/bn_scale"
  input: "conv5_1/dw/bn_bias"
  input: "conv5_1/dw/bn_mean"
  input: "conv5_1/dw/bn_var"
  output: "conv5_1/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_1/dw/bn"
  input: "conv5_1/dw/bn_w"
  output: "conv5_1/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_1/dw/bn_internal"
  input: "conv5_1/dw/bn_b"
  output: "conv5_1/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_1/dw/bn"
  output: "conv5_1/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_1/dw/bn"
  input: "conv5_1/sep_w"
  output: "conv5_1/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_1/sep"
  input: "conv5_1/sep/bn_scale"
  input: "conv5_1/sep/bn_bias"
  input: "conv5_1/sep/bn_mean"
  input: "conv5_1/sep/bn_var"
  output: "conv5_1/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_1/sep/bn"
  input: "conv5_1/sep/bn_w"
  output: "conv5_1/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_1/sep/bn_internal"
  input: "conv5_1/sep/bn_b"
  output: "conv5_1/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_1/sep/bn"
  output: "conv5_1/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_1/sep/bn"
  input: "conv5_2/dw_w"
  output: "conv5_2/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_2/dw"
  input: "conv5_2/dw/bn_scale"
  input: "conv5_2/dw/bn_bias"
  input: "conv5_2/dw/bn_mean"
  input: "conv5_2/dw/bn_var"
  output: "conv5_2/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_2/dw/bn"
  input: "conv5_2/dw/bn_w"
  output: "conv5_2/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_2/dw/bn_internal"
  input: "conv5_2/dw/bn_b"
  output: "conv5_2/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_2/dw/bn"
  output: "conv5_2/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_2/dw/bn"
  input: "conv5_2/sep_w"
  output: "conv5_2/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_2/sep"
  input: "conv5_2/sep/bn_scale"
  input: "conv5_2/sep/bn_bias"
  input: "conv5_2/sep/bn_mean"
  input: "conv5_2/sep/bn_var"
  output: "conv5_2/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_2/sep/bn"
  input: "conv5_2/sep/bn_w"
  output: "conv5_2/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_2/sep/bn_internal"
  input: "conv5_2/sep/bn_b"
  output: "conv5_2/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_2/sep/bn"
  output: "conv5_2/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_2/sep/bn"
  input: "conv5_3/dw_w"
  output: "conv5_3/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_3/dw"
  input: "conv5_3/dw/bn_scale"
  input: "conv5_3/dw/bn_bias"
  input: "conv5_3/dw/bn_mean"
  input: "conv5_3/dw/bn_var"
  output: "conv5_3/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_3/dw/bn"
  input: "conv5_3/dw/bn_w"
  output: "conv5_3/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_3/dw/bn_internal"
  input: "conv5_3/dw/bn_b"
  output: "conv5_3/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_3/dw/bn"
  output: "conv5_3/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_3/dw/bn"
  input: "conv5_3/sep_w"
  output: "conv5_3/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_3/sep"
  input: "conv5_3/sep/bn_scale"
  input: "conv5_3/sep/bn_bias"
  input: "conv5_3/sep/bn_mean"
  input: "conv5_3/sep/bn_var"
  output: "conv5_3/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_3/sep/bn"
  input: "conv5_3/sep/bn_w"
  output: "conv5_3/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_3/sep/bn_internal"
  input: "conv5_3/sep/bn_b"
  output: "conv5_3/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_3/sep/bn"
  output: "conv5_3/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_3/sep/bn"
  input: "conv5_4/dw_w"
  output: "conv5_4/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_4/dw"
  input: "conv5_4/dw/bn_scale"
  input: "conv5_4/dw/bn_bias"
  input: "conv5_4/dw/bn_mean"
  input: "conv5_4/dw/bn_var"
  output: "conv5_4/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_4/dw/bn"
  input: "conv5_4/dw/bn_w"
  output: "conv5_4/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_4/dw/bn_internal"
  input: "conv5_4/dw/bn_b"
  output: "conv5_4/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_4/dw/bn"
  output: "conv5_4/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_4/dw/bn"
  input: "conv5_4/sep_w"
  output: "conv5_4/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_4/sep"
  input: "conv5_4/sep/bn_scale"
  input: "conv5_4/sep/bn_bias"
  input: "conv5_4/sep/bn_mean"
  input: "conv5_4/sep/bn_var"
  output: "conv5_4/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_4/sep/bn"
  input: "conv5_4/sep/bn_w"
  output: "conv5_4/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_4/sep/bn_internal"
  input: "conv5_4/sep/bn_b"
  output: "conv5_4/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_4/sep/bn"
  output: "conv5_4/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_4/sep/bn"
  input: "conv5_5/dw_w"
  output: "conv5_5/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_5/dw"
  input: "conv5_5/dw/bn_scale"
  input: "conv5_5/dw/bn_bias"
  input: "conv5_5/dw/bn_mean"
  input: "conv5_5/dw/bn_var"
  output: "conv5_5/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_5/dw/bn"
  input: "conv5_5/dw/bn_w"
  output: "conv5_5/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_5/dw/bn_internal"
  input: "conv5_5/dw/bn_b"
  output: "conv5_5/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_5/dw/bn"
  output: "conv5_5/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_5/dw/bn"
  input: "conv5_5/sep_w"
  output: "conv5_5/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_5/sep"
  input: "conv5_5/sep/bn_scale"
  input: "conv5_5/sep/bn_bias"
  input: "conv5_5/sep/bn_mean"
  input: "conv5_5/sep/bn_var"
  output: "conv5_5/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_5/sep/bn"
  input: "conv5_5/sep/bn_w"
  output: "conv5_5/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_5/sep/bn_internal"
  input: "conv5_5/sep/bn_b"
  output: "conv5_5/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_5/sep/bn"
  output: "conv5_5/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_5/sep/bn"
  input: "conv5_6/dw_w"
  output: "conv5_6/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 512
  }
}
op {
  input: "conv5_6/dw"
  input: "conv5_6/dw/bn_scale"
  input: "conv5_6/dw/bn_bias"
  input: "conv5_6/dw/bn_mean"
  input: "conv5_6/dw/bn_var"
  output: "conv5_6/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_6/dw/bn"
  input: "conv5_6/dw/bn_w"
  output: "conv5_6/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_6/dw/bn_internal"
  input: "conv5_6/dw/bn_b"
  output: "conv5_6/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_6/dw/bn"
  output: "conv5_6/dw/bn"
  type: "Relu"
}
op {
  input: "conv5_6/dw/bn"
  input: "conv5_6/sep_w"
  output: "conv5_6/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv5_6/sep"
  input: "conv5_6/sep/bn_scale"
  input: "conv5_6/sep/bn_bias"
  input: "conv5_6/sep/bn_mean"
  input: "conv5_6/sep/bn_var"
  output: "conv5_6/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv5_6/sep/bn"
  input: "conv5_6/sep/bn_w"
  output: "conv5_6/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_6/sep/bn_internal"
  input: "conv5_6/sep/bn_b"
  output: "conv5_6/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv5_6/sep/bn"
  output: "conv5_6/sep/bn"
  type: "Relu"
}
op {
  input: "conv5_6/sep/bn"
  input: "conv6/dw_w"
  output: "conv6/dw"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "group"
    i: 1024
  }
}
op {
  input: "conv6/dw"
  input: "conv6/dw/bn_scale"
  input: "conv6/dw/bn_bias"
  input: "conv6/dw/bn_mean"
  input: "conv6/dw/bn_var"
  output: "conv6/dw/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv6/dw/bn"
  input: "conv6/dw/bn_w"
  output: "conv6/dw/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv6/dw/bn_internal"
  input: "conv6/dw/bn_b"
  output: "conv6/dw/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv6/dw/bn"
  output: "conv6/dw/bn"
  type: "Relu"
}
op {
  input: "conv6/dw/bn"
  input: "conv6/sep_w"
  output: "conv6/sep"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "conv6/sep"
  input: "conv6/sep/bn_scale"
  input: "conv6/sep/bn_bias"
  input: "conv6/sep/bn_mean"
  input: "conv6/sep/bn_var"
  output: "conv6/sep/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv6/sep/bn"
  input: "conv6/sep/bn_w"
  output: "conv6/sep/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv6/sep/bn_internal"
  input: "conv6/sep/bn_b"
  output: "conv6/sep/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "conv6/sep/bn"
  output: "conv6/sep/bn"
  type: "Relu"
}
op {
  input: "conv6/sep/bn"
  output: "pool6"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
  arg {
    name: "global_pooling"
    i: 1
  }
}
op {
  input: "pool6"
  input: "fc7_w"
  input: "fc7_b"
  output: "fc7"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
}
op {
  input: "fc7"
  output: "prob"
  type: "Softmax"
}
external_input: "data"
external_input: "conv1_w"
external_input: "conv1/bn_scale"
external_input: "conv1/bn_bias"
external_input: "conv1/bn_mean"
external_input: "conv1/bn_var"
external_input: "conv1/bn_w"
external_input: "conv1/bn_b"
external_input: "conv2_1/dw_w"
external_input: "conv2_1/dw/bn_scale"
external_input: "conv2_1/dw/bn_bias"
external_input: "conv2_1/dw/bn_mean"
external_input: "conv2_1/dw/bn_var"
external_input: "conv2_1/dw/bn_w"
external_input: "conv2_1/dw/bn_b"
external_input: "conv2_1/sep_w"
external_input: "conv2_1/sep/bn_scale"
external_input: "conv2_1/sep/bn_bias"
external_input: "conv2_1/sep/bn_mean"
external_input: "conv2_1/sep/bn_var"
external_input: "conv2_1/sep/bn_w"
external_input: "conv2_1/sep/bn_b"
external_input: "conv2_2/dw_w"
external_input: "conv2_2/dw/bn_scale"
external_input: "conv2_2/dw/bn_bias"
external_input: "conv2_2/dw/bn_mean"
external_input: "conv2_2/dw/bn_var"
external_input: "conv2_2/dw/bn_w"
external_input: "conv2_2/dw/bn_b"
external_input: "conv2_2/sep_w"
external_input: "conv2_2/sep/bn_scale"
external_input: "conv2_2/sep/bn_bias"
external_input: "conv2_2/sep/bn_mean"
external_input: "conv2_2/sep/bn_var"
external_input: "conv2_2/sep/bn_w"
external_input: "conv2_2/sep/bn_b"
external_input: "conv3_1/dw_w"
external_input: "conv3_1/dw/bn_scale"
external_input: "conv3_1/dw/bn_bias"
external_input: "conv3_1/dw/bn_mean"
external_input: "conv3_1/dw/bn_var"
external_input: "conv3_1/dw/bn_w"
external_input: "conv3_1/dw/bn_b"
external_input: "conv3_1/sep_w"
external_input: "conv3_1/sep/bn_scale"
external_input: "conv3_1/sep/bn_bias"
external_input: "conv3_1/sep/bn_mean"
external_input: "conv3_1/sep/bn_var"
external_input: "conv3_1/sep/bn_w"
external_input: "conv3_1/sep/bn_b"
external_input: "conv3_2/dw_w"
external_input: "conv3_2/dw/bn_scale"
external_input: "conv3_2/dw/bn_bias"
external_input: "conv3_2/dw/bn_mean"
external_input: "conv3_2/dw/bn_var"
external_input: "conv3_2/dw/bn_w"
external_input: "conv3_2/dw/bn_b"
external_input: "conv3_2/sep_w"
external_input: "conv3_2/sep/bn_scale"
external_input: "conv3_2/sep/bn_bias"
external_input: "conv3_2/sep/bn_mean"
external_input: "conv3_2/sep/bn_var"
external_input: "conv3_2/sep/bn_w"
external_input: "conv3_2/sep/bn_b"
external_input: "conv4_1/dw_w"
external_input: "conv4_1/dw/bn_scale"
external_input: "conv4_1/dw/bn_bias"
external_input: "conv4_1/dw/bn_mean"
external_input: "conv4_1/dw/bn_var"
external_input: "conv4_1/dw/bn_w"
external_input: "conv4_1/dw/bn_b"
external_input: "conv4_1/sep_w"
external_input: "conv4_1/sep/bn_scale"
external_input: "conv4_1/sep/bn_bias"
external_input: "conv4_1/sep/bn_mean"
external_input: "conv4_1/sep/bn_var"
external_input: "conv4_1/sep/bn_w"
external_input: "conv4_1/sep/bn_b"
external_input: "conv4_2/dw_w"
external_input: "conv4_2/dw/bn_scale"
external_input: "conv4_2/dw/bn_bias"
external_input: "conv4_2/dw/bn_mean"
external_input: "conv4_2/dw/bn_var"
external_input: "conv4_2/dw/bn_w"
external_input: "conv4_2/dw/bn_b"
external_input: "conv4_2/sep_w"
external_input: "conv4_2/sep/bn_scale"
external_input: "conv4_2/sep/bn_bias"
external_input: "conv4_2/sep/bn_mean"
external_input: "conv4_2/sep/bn_var"
external_input: "conv4_2/sep/bn_w"
external_input: "conv4_2/sep/bn_b"
external_input: "conv5_1/dw_w"
external_input: "conv5_1/dw/bn_scale"
external_input: "conv5_1/dw/bn_bias"
external_input: "conv5_1/dw/bn_mean"
external_input: "conv5_1/dw/bn_var"
external_input: "conv5_1/dw/bn_w"
external_input: "conv5_1/dw/bn_b"
external_input: "conv5_1/sep_w"
external_input: "conv5_1/sep/bn_scale"
external_input: "conv5_1/sep/bn_bias"
external_input: "conv5_1/sep/bn_mean"
external_input: "conv5_1/sep/bn_var"
external_input: "conv5_1/sep/bn_w"
external_input: "conv5_1/sep/bn_b"
external_input: "conv5_2/dw_w"
external_input: "conv5_2/dw/bn_scale"
external_input: "conv5_2/dw/bn_bias"
external_input: "conv5_2/dw/bn_mean"
external_input: "conv5_2/dw/bn_var"
external_input: "conv5_2/dw/bn_w"
external_input: "conv5_2/dw/bn_b"
external_input: "conv5_2/sep_w"
external_input: "conv5_2/sep/bn_scale"
external_input: "conv5_2/sep/bn_bias"
external_input: "conv5_2/sep/bn_mean"
external_input: "conv5_2/sep/bn_var"
external_input: "conv5_2/sep/bn_w"
external_input: "conv5_2/sep/bn_b"
external_input: "conv5_3/dw_w"
external_input: "conv5_3/dw/bn_scale"
external_input: "conv5_3/dw/bn_bias"
external_input: "conv5_3/dw/bn_mean"
external_input: "conv5_3/dw/bn_var"
external_input: "conv5_3/dw/bn_w"
external_input: "conv5_3/dw/bn_b"
external_input: "conv5_3/sep_w"
external_input: "conv5_3/sep/bn_scale"
external_input: "conv5_3/sep/bn_bias"
external_input: "conv5_3/sep/bn_mean"
external_input: "conv5_3/sep/bn_var"
external_input: "conv5_3/sep/bn_w"
external_input: "conv5_3/sep/bn_b"
external_input: "conv5_4/dw_w"
external_input: "conv5_4/dw/bn_scale"
external_input: "conv5_4/dw/bn_bias"
external_input: "conv5_4/dw/bn_mean"
external_input: "conv5_4/dw/bn_var"
external_input: "conv5_4/dw/bn_w"
external_input: "conv5_4/dw/bn_b"
external_input: "conv5_4/sep_w"
external_input: "conv5_4/sep/bn_scale"
external_input: "conv5_4/sep/bn_bias"
external_input: "conv5_4/sep/bn_mean"
external_input: "conv5_4/sep/bn_var"
external_input: "conv5_4/sep/bn_w"
external_input: "conv5_4/sep/bn_b"
external_input: "conv5_5/dw_w"
external_input: "conv5_5/dw/bn_scale"
external_input: "conv5_5/dw/bn_bias"
external_input: "conv5_5/dw/bn_mean"
external_input: "conv5_5/dw/bn_var"
external_input: "conv5_5/dw/bn_w"
external_input: "conv5_5/dw/bn_b"
external_input: "conv5_5/sep_w"
external_input: "conv5_5/sep/bn_scale"
external_input: "conv5_5/sep/bn_bias"
external_input: "conv5_5/sep/bn_mean"
external_input: "conv5_5/sep/bn_var"
external_input: "conv5_5/sep/bn_w"
external_input: "conv5_5/sep/bn_b"
external_input: "conv5_6/dw_w"
external_input: "conv5_6/dw/bn_scale"
external_input: "conv5_6/dw/bn_bias"
external_input: "conv5_6/dw/bn_mean"
external_input: "conv5_6/dw/bn_var"
external_input: "conv5_6/dw/bn_w"
external_input: "conv5_6/dw/bn_b"
external_input: "conv5_6/sep_w"
external_input: "conv5_6/sep/bn_scale"
external_input: "conv5_6/sep/bn_bias"
external_input: "conv5_6/sep/bn_mean"
external_input: "conv5_6/sep/bn_var"
external_input: "conv5_6/sep/bn_w"
external_input: "conv5_6/sep/bn_b"
external_input: "conv6/dw_w"
external_input: "conv6/dw/bn_scale"
external_input: "conv6/dw/bn_bias"
external_input: "conv6/dw/bn_mean"
external_input: "conv6/dw/bn_var"
external_input: "conv6/dw/bn_w"
external_input: "conv6/dw/bn_b"
external_input: "conv6/sep_w"
external_input: "conv6/sep/bn_scale"
external_input: "conv6/sep/bn_bias"
external_input: "conv6/sep/bn_mean"
external_input: "conv6/sep/bn_var"
external_input: "conv6/sep/bn_w"
external_input: "conv6/sep/bn_b"
external_input: "fc7_w"
external_input: "fc7_b"
external_output: "prob"
